
VeryShort VeryShort::operator+(const VeryShort &rhs)
{
	itsVal += rhs.GetItsVal();
	return *this;
}   

// У цьому коді є кілька помилок.
// 1. Зміна поточного об'єкта: оператор + не повинен змінювати поточний об'єкт. 
//    Він має створювати новий об'єкт, який є результатом сумування.
// 2. Неправильне повернення значення: повертається посилання на поточний об'єкт (*this), 
//    а не новий об'єкт з результатом сумування.
// 3. Бажано використовувати const: оператор + зазвичай не змінює жоден з операндів, 
//    тому метод повинен бути константним.

//Ось правильна версія,


VeryShort VeryShort::operator+(const VeryShort &rhs) const
{
    return VeryShort(itsVal + rhs.GetItsVal());
}


